import React from "react";

export const Yakuman = () => {
  return (
    <div className="yakuman">
      <h2>役満</h2>
      <h3>大三元（ダイサンゲン）</h3>
      <p>三元牌全てを刻子で揃えると成立する役</p>
      <h3>大四喜（ダイスーシー）</h3>
      <p>風牌（東、南、西、北）全てを刻子で揃えると成立する役</p>
      <p>ダブル役満を採用しているルールではダブル役満になる</p>
      <h3>小四喜（ショウスーシー）</h3>
      <p>雀頭と3組の刻子を風牌で揃えると成立する役</p>
      <h3>字一色（ツーイーソー）</h3>
      <p>字牌のみの手配で上がると成立する役</p>
      <h3>緑一色（リューイーソー）</h3>
      <p>手牌が發、索子（ソウズ）の2,3,4,6,8のいずれかのみの時成立する役</p>
      <p>全て緑色だけの牌</p>
      <h3>四暗刻（スーアンコウ）</h3>
      <p>4つの暗刻を揃えると成立する役</p>
      <h3>四槓子（スーカンツ）</h3>
      <p>4つの槓子を揃えると成立する役</p>
      <h3>清老頭（チンロウトウ）</h3>
      <p>手牌が数牌の1,9のみの時成立する役</p>
      <h3>九蓮宝燈（チューレンポウトウ）</h3>
      <p>1種の数牌で「1112345678999 + 1~9いずれか1つ」を揃えた時に成立する役</p>
      <h3>国士無双（コクシムソウ）</h3>
      <p>各種数牌の1,9と字牌全て1牌ずつと1,9,字牌いずれか1牌で成立する役</p>
      <h3>天和（テンホウ）</h3>
      <p>親が1巡目のツモであがると成立する役</p>
      <h3>地和（チーホー）</h3>
      <p>子が1巡目のツモであがると成立する役</p>
    </div>
  );
};
