import React from "react";

export const Yaku2 = () => {
  return (
    <div className="yaku2">
      <h2>2飜</h2>
      <h3>ダブルリーチ</h3>
      <p>局開始後、1巡目で立直宣言することで成立する役</p>
      <h3>対々和（トイトイ）</h3>
      <p>面子が全て刻子の時成立する役</p>
      <h3>七対子（チートイツ）</h3>
      <p>トイツ（同じ牌２つ）を７組揃えると成立する役</p>
      <h3>三暗刻</h3>
      <p>暗刻（鳴かずにできた刻子）を３つ揃えると成立する役</p>
      <h3>三色同順</h3>
      <p>同じ数牌の順子を３種類揃えると成立する役</p>
      <h3>三色同刻</h3>
      <p>同じ数牌の刻子を３種類揃えると成立する役</p>
      <h3>一気通貫</h3>
      <p>1種類の数牌で「123」「456」「789」の順子を揃えると成立する役</p>
      <h3>混全帯么九（チャンタ）</h3>
      <p>全ての面子,雀頭で数牌の1,9、字牌が含まれている時に成立する役</p>
      <h3>混老頭（ホンロウトウ）</h3>
      <p>手牌全てが数牌の1,9、字牌のみで構成されているときに成立する役</p>
      <h3>小三元</h3>
      <p>三元牌で雀頭と面子2組を揃えると成立する役</p>
      <h3>三槓子</h3>
      <p>槓子を3組揃えると成立する役</p>
    </div>
  );
};
