import React from "react";

export const Yaku1 = () => {
  return (
    <div className="yaku1">
      <h2>１飜</h2>
      <h3>門前清自摸和（ツモ）</h3>
      <p>面前でテンパイし、ツモ上がりすると成立する役</p>
      <h3>立直（リーチ）</h3>
      <p>面前でテンパイを「リーチ」と宣言することで成立する役</p>
      <p>宣言後は手牌の変更はできない</p>
      <h3>一発</h3>
      <p>
        立直宣言後、１巡以内で出あがり（ロン）または、ツモ上がりすることで成立する役
      </p>
      <h3>平和（ピンフ）</h3>
      <p>
        面子が全て順子、雀頭（頭）が役牌以外のリャンメン待ちでの上がりで成立する役
      </p>
      <h3>断么九（タンヤオ）</h3>
      <p>２〜９の数牌のみの手牌で上がると成立する役</p>
      <h3>一盃口（イーペーコー）</h3>
      <p>同種同順の順子が2つ手牌にある状態で上がると成立する役</p>
      <h3>役牌</h3>
      <p>
        自風牌、場風牌、三元牌（白、發、中）のいずれかの字牌を刻子で揃えると成立する役
      </p>
      <h3>槍槓（チャンカン）</h3>
      <p>他家（ターチャ）が槓（カン）した牌で上がると成立する役</p>
      <h3>嶺上開花（リンシャンカイホウ）</h3>
      <p>嶺上牌（槓してツモる牌）で上がると成立する役</p>
      <h3>海底摸月（ハイテイ）</h3>
      <p>海底牌（局の最後のツモ牌）でツモ上がりすると成立する役</p>
      <h3>河底撈魚（ホウテイ）</h3>
      <p>河底牌（局の最後の捨て牌）で出あがりすると成立する役</p>
    </div>
  );
};
